[
  {
    "lesson": "Going to College",
    "title": "Customer Service Representative",
    "content": ":::center\n # COME WORK FOR CONNECTCO!\n:::\n\n## ConnectCo Seeking Customer Service Representative\n\n::::columns\n:::col\n**Company Name:** ConnectCo Communications\n:::\n:::col\n**Location:** Orlando, FL (On-site)<br>**Position Type:** Full-Time<br>**Salary:** $16–$18/hour\n:::\n::::\n\n### About the Job\nAre you looking to start your career in a dynamic yet supportive environment that values work-life balance? ConnectCo Communications is seeking enthusiastic individuals to join our team as Customer Service Representatives. As the first point of contact for our valued customers, you'll play a crucial role in ensuring that their questions and concerns are addressed quickly and professionally. This is a fantastic opportunity for individuals who are eager to learn, grow, and find collaborative and solution-focused approaches. In this role, you'll handle customer inquiries through phone, email, and chat, providing clear and accurate information to resolve their concerns. You'll also document interactions in our customer relationship management system, ensuring that records are up to date.\n\n### What We're Looking For\nOur training program will provide you with the tools and knowledge needed to succeed, even if you don't have prior experience in customer service. While <correct>we require at least a high school diploma or GED</correct>, <correct>candidates who have completed some college coursework or hold an associate degree in business, communication, or a related field are encouraged to apply.</correct> We highly value candidates who bring diverse perspectives to our team, and bilingual individuals or those with multicultural communication experience are encouraged to apply. Successful candidates are detail-oriented, organized, and comfortable working in a fast-paced environment. If you're looking for a role where you can develop professionally, this is the perfect place to start.\n\n### What We Offer\n*   A competitive hourly wage of $16–$18, with opportunities increases.\n*   Health, dental, and vision insurance plans to keep you and your family covered.\n*   Paid time off, including sick leave and vacation days, to support your work-life balance.\n*   Access to an Employee Assistance Program (EAP) for health and wellness support.\n*   Discounts on local attractions, services, and products through our employee perks program.\n\n### Why Join Us\n*   Be part of a team that values empathy, collaboration, and outstanding customer service.\n*   Start your career with a company that invests in your growth through comprehensive training and mentorship programs.\n*   Build connections with a diverse group of colleagues who bring unique perspectives to the workplace.\n\n:::center\n**Apply today and be a part of the ConnectCo Family!**\n:::",
    "order": 6
  }
]
