[
  {
    "lesson": "Going to College",
    "title": "Job Hunt #1",
    "instructions": "Look at a job listing and see if you can find (1) the required minimum education level and (2) the preferred education level. You will need to click on the job listing in those two places to continue. If you want a challenge, you can try out each job listing.",
    "content": ":::center\n # COME WORK FOR CONNECTCO!\n:::\n\n## ConnectCo Seeking Customer Service Representative\n\n::::columns\n:::col\n**Company Name:** ConnectCo Communications\n:::\n:::col\n**Location:** Orlando, FL (On-site)<br>**Position Type:** Full-Time<br>**Salary:** $16–$18/hour\n:::\n::::\n\n### About the Job\nAre you looking to start your career in a dynamic yet supportive environment that values work-life balance? ConnectCo Communications is seeking enthusiastic individuals to join our team as Customer Service Representatives. As the first point of contact for our valued customers, you'll play a crucial role in ensuring that their questions and concerns are addressed quickly and professionally. This is a fantastic opportunity for individuals who are eager to learn, grow, and find collaborative and solution-focused approaches. In this role, you'll handle customer inquiries through phone, email, and chat, providing clear and accurate information to resolve their concerns. You'll also document interactions in our customer relationship management system, ensuring that records are up to date.\n\n### What We're Looking For\nOur training program will provide you with the tools and knowledge needed to succeed, even if you don't have prior experience in customer service. While <correct>we require at least a high school diploma or GED</correct>, <correct>candidates who have completed some college coursework or hold an associate degree in business, communication, or a related field are encouraged to apply.</correct> We highly value candidates who bring diverse perspectives to our team, and bilingual individuals or those with multicultural communication experience are encouraged to apply. Successful candidates are detail-oriented, organized, and comfortable working in a fast-paced environment. If you're looking for a role where you can develop professionally, this is the perfect place to start.\n\n### What We Offer\n*   A competitive hourly wage of $16–$18, with opportunities increases.\n*   Health, dental, and vision insurance plans to keep you and your family covered.\n*   Paid time off, including sick leave and vacation days, to support your work-life balance.\n*   Access to an Employee Assistance Program (EAP) for health and wellness support.\n*   Discounts on local attractions, services, and products through our employee perks program.\n\n### Why Join Us\n*   Be part of a team that values empathy, collaboration, and outstanding customer service.\n*   Start your career with a company that invests in your growth through comprehensive training and mentorship programs.\n*   Build connections with a diverse group of colleagues who bring unique perspectives to the workplace.\n\n:::center\n**Apply today and be a part of the ConnectCo Family!**\n:::",
    "order": 6
  },
  {
    "lesson": "Going to College",
    "title": "Job Hunt #2",
    "instructions": "Look at a job listing and see if you can find (1) the required minimum education level and (2) the preferred education level. You will need to click on the job listing in those two places to continue. If you want a challenge, you can try out each job listing.",
    "content": ":::center\n# Marketing Specialist\n:::\n\n**Company Name:** BrightFuture Marketing <br> **Position:** Marketing Specialist <br> **Location:** Denver, CO (Hybrid options available) <br> **Position Type:** Full-Time <br> **Salary:** $60,000–$70,000/year\n\nBrightFuture Marketing is searching for a motivated and creative Marketing Specialist to join our growing team. This position is perfect for professionals ready to advance their marketing careers and take on exciting new challenges. As a Marketing Specialist, you'll have the opportunity to contribute to impactful campaigns, collaborate with talented colleagues, and make a measurable difference in our clients' success. In this role, you'll design and conduct digital marketing campaigns that engage target audiences and drive results. Whether developing content for social media, crafting email marketing strategies, or managing paid advertising initiatives, you'll play a central role in shaping our clients' brands. Additionally, you'll analyze campaign performance, provide actionable insights, and adjust strategies to ensure continued success.\n\n## Qualifications:\n\n*   Skilled communicator, able to assess clients' needs and offer customized experiences\n*   Portfolio of successful past marketing campaigns/examples\n*   <correct>Master's degree and 3-5 years of experience preferred</correct>\n*   Certifications in digital marketing, SEO, or social media strategy preferred\n\nOur ideal applicant is highly skilled and has substantial marketing experience. Although we prefer candidates with higher levels of education, <correct>we will consider applicants with Bachelor's degrees in marketing, communications, business or related fields</correct> with the right experience and demonstration of skill. We are looking for a team player who can lead campaigns and train lower level employees to support our mission.\n\n## Why Work With Us?\n\n*   Competitive salary and bonus opportunities.\n*   Comprehensive health, dental, and vision insurance.\n*   Generous PTO and flexible scheduling options.\n*   Tuition reimbursement and ongoing professional development.\n*   A collaborative and creative workplace culture.\n\nBrightFuture Marketing's hybrid work model allows you to enjoy the energy of in-office collaboration while maintaining flexibility. We pride ourselves on fostering innovation and supporting our team members' growth. If you're ready to take the next step in your career and join a forward-thinking company, we'd love to hear from you! We are proud to be an Equal Employment Opportunity employer and welcome applications from individuals of all backgrounds, regardless of race, color, religion, gender, sexual orientation, national origin, age, disability, or veteran status.\n",
    "order": 7
  },
  {
    "lesson": "Going to College",
    "title": "Job Hunt #3",
    "instructions": "Look at a job listing and see if you can find (1) the required minimum education level and (2) the preferred education level. You will need to click on the job listing in those two places to continue. If you want a challenge, you can try out each job listing.",
    "content": ":::center\n# Software Development Manager\n:::\n\n**Company Name:** TechInnovate Solutions <br> **Location:** Seattle, WA (Remote with occasional travel to headquarters) <br> **Position Type:** Full-Time <br> **Salary:** $135,000–$155,000/year\n\nTechInnovate Solutions is looking for a visionary **Software Development Manager** to lead our\nteam of talented developers in creating innovative software solutions. This role is pivotal to our\nsuccess as we expand our portfolio of high-quality products and services. We are searching for\nan experienced professional who can blend technical expertise with strong leadership skills to\ndrive our projects forward.\n\nAs the Software Development Manager, you will oversee multiple projects, ensuring they are\ndelivered on time and within budget. You'll lead a team of developers, providing mentorship and\nfostering an environment of growth and collaboration. By working closely with stakeholders and\ncross-functional teams, you'll ensure that all technical solutions align with our broader business\nobjectives.\n\nCandidates for this role must hold a <correct>Bachelor's degree in Computer Science, Software Engineering, or a related field</correct>, with at least 7 years of experience in software development.\nWhile a Bachelor's degree is required, a <correct>Master's degree and significant experience in\nleadership roles are strongly preferred.</correct> Expertise in agile development methodologies,\ncloud-based systems, and programming languages such as Python or Java will be essential to\nyour success.\n\n:::center\n## What We Offer\n:::\n\n*   Competitive salary with annual performance-based bonuses.\n*   Fully remote work with flexible scheduling.\n*   Comprehensive benefits package, including health, dental, and vision coverage.\n*   Generous PTO, parental leave, and professional development opportunities.\n*   Stock options and opportunities for career advancement.\n\nAt TechInnovate Solutions, we pride ourselves on cultivating a supportive and inclusive\nworkplace where innovation thrives. If you're passionate about technology and ready to take on\na leadership role at a company that values excellence, we encourage you to apply. Let's build\nthe future together.\n\nTechInnovate Solutions is an equal opportunity employer.\n",
    "order": 8
  }
]
