[
    {
        "lesson": "Going to College",
      "title": "Introduction to Going to College",
      "content": "Are you planning on going to college? This lesson will teach you the basics about different types of colleges, degrees, and how to apply and pay for college.",
      "order": 1
    },
    {
        "lesson": "Going to College",
      "title": "Types of College",
      "content": "There are many types of colleges and ways to receive post-secondary education. There are also different types of degrees that you can get, providing various levels of expertise. Sometimes you won't know what a college offers until you ask, so it's all a matter of finding the perfect fit for you!",
      "order": 2
    },
    {
        "lesson": "Going to College",
      "title": "Trade and Technical Schools",
      "content": "Trade and technical schools, sometimes called vocational training schools, are schools that provide education for a specific focus area without requiring general education classes. These schools typically provide certificates or associates degrees, take 1-3 years to complete, and often incorporate lots of hands-on experience.",
      "order": 3
    },
    {
        "lesson": "Going to College",
      "title": "Community Colleges",
      "content": "Community colleges provide education for a variety of subjects, including general education and more career-specific classes. Most community colleges offer 2-year associates degrees and certificates. Some community colleges have begun offering 4-year bachelor's degrees as well. Community colleges typically have lower tuition than 4-year colleges and universities and may be more flexible in the times of day in which classes are offered.",
      "order": 4
    },
    {
        "lesson": "Going to College",
      "title": "4-Year Colleges",
      "content": "4-year colleges focus on offering bachelor's degrees and provide classes in both general studies and specific focus areas, referred to as majors. 4-year can include universities and liberal arts colleges, and are usually private (funded by tuition and other sources, sometimes more expensive or exclusive).",
      "order": 5
    },
    {
        "lesson": "Going to College",
      "title": "Universities",
      "content": "Universities are larger schools and offer a wide variety of majors and degrees, including certificates, associate's, bachelor's, master's, and doctoral degrees. They may also include professional training such as medical and law schools. Universities can be public (funded by the government, typically cheaper) or private (funded by tuition and other sources, sometimes more expensive or exclusive).",
      "order": 6
    },
    {
        "lesson": "Going to College",
      "title": "Choosing a College",
      "content": "Choosing what type of college to attend depends on a lot of factors such as location, cost, the type of experience you are seeking, and importantly, the type of job you want to have. Different jobs require different levels of experience.",
      "order": 7
    },
    {
        "lesson": "Going to College",
      "title": "College Majors",
      "content": "A major is the subject someone chooses to study in-depth while attending college, and ultimately determine the type of career someone will be qualified to have. Majors also determine which classes are required in college to complete a degree.",
      "order": 8
    },
    {
        "lesson": "Going to College",
      "title": "Finances and College",
      "content": "What you've heard is true—college is expensive. Here we'll go over some of the cost and share strategies for making college affordable. With the right plan and resources, it's possible to avoid debt, or at least keep your costs lower when attending college.",
      "order": 9
    },
    {
        "lesson": "Going to College",
      "title": "College Costs",
      "content": "College Costs Include: Tuition and Fees, Room and Board, Meal plans, Books and Supplies, Health insurance, Transportation, and Personal Expenses.",
      "order": 10
    },
    {
        "lesson": "Going to College",
      "title": "FAFSA",
      "content": "The FASFA, or Free Application for Federal Student Aid, is a form available online that identifies financial aid sources you are eligible for with colleges you consider attending. Watch the video to learn more about the FAFSA.",
      "order": 11
    },
    {
        "lesson": "Going to College",
      "title": "Grants",
      "content": "One type of financial support the FAFSA can offer you is grants. Grants are financial support that does not typically have to be repaid. These funds will be either given to you directly or applied to your school financial account. When either happens, the grant should be applied first to your tuition and other academic fees, and secondly to your housing. Additional oney can go toward other school fees and costs such as textbooks and health insurance. ",
      "order": 12
    },
    {
        "lesson": "Going to College",
      "title": "Loans",
      "content": "FAFSA can also offer you loans, which you will be required to pay back after your degree. Depending on the type of loan, these may begin collecting interest during or after your degree. If you take a loan and don't finish your degree, you still have to pay for the money you have borrowed!  Loans are applied like grants to tuition and fees, then housing and other costs.",
      "order": 13
    },
    {
        "lesson": "Going to College",
      "title": "Work-Study",
      "content": "Work-study is a form of financial aid that allows you to earn money by working part-time while attending school. The jobs are often on-campus or related to your field of study, making it easier to balance work and academics. Work-study earnings can help cover expenses like books, transportation, and personal costs. This aid is need-based and awarded through FAFSA, so if you’re interested, make sure to indicate your preference for work-study when completing your application.",
      "order": 14
    },
    {
        "lesson": "Going to College",
      "title": "Western Undergraduate Exchange",
      "content": "The Western Undergraduate Exchange (WUE) is a program offered by the Western Interstate Commission for Higher Education (WICHE) that helps students save on tuition costs by allowing them to pay reduced out-of-state tuition at participating schools. save on tuition costs by allowing them to pay reduced out-of-state tuition at participating schools. Through WUE, students pay no more than 150% of in-state tuition, which can significantly lower the cost of attending college outside their home state. The program includes students from the following 16 western states and territories: Alaska, Arizona, California, Colorado, Hawaii, Idaho, Montana, Nevada, New Mexico, North Dakota, Oregon, South Dakota, Utah, Washington, Wyoming, and the Commonwealth of the Northern Mariana Islands. To take advantage of WUE, check your eligibility and apply early as some schools have limited spots for WUE students or require separate applications.",
      "order": 15
    },
    {
        "lesson": "Going to College",
      "title": "Scholarships",
      "content": "Scholarships are another form of financial support that can help you pay for your education. Unlike loans, scholarships do not need to be repaid. They are often awarded based on academic achievements, extracurricular activities, or financial need, and some are specifically for students in certain fields or with unique qualifications. Scholarships do not come from the FAFSA may come from your school, private organizations, or community groups and can be applied to tuition, housing, or other academic expenses. There are many ways to find scholarships online and your college may have a specific page for available scholarships. Some scholarships may require you to submit a resume, an essay, or other work to be considered.",
      "order": 16
    },
    {
        "lesson": "Going to College",
      "title": "Applying for College",
      "content": "Applying for college is an exciting step toward your future, but it can feel overwhelming if you're not sure where to start. Don't worry—we've got you covered! In this section, we'll walk you through the key steps of the application process, help you gather everything you'll need, and share strategies for overcoming challenges along the way. Watch this video to learn the basics of what you need to know.",
      "order": 17
    },
    {
        "lesson": "Going to College",
      "title": "Application Requirements",
      "content": "College applications can take quite a bit of time to complete and you may be surprised by everything they ask for you to submit. Being prepared with documents ahead of time and creating checklists of what each school needs can help you stay organized.",
      "order": 18
    }
]
